"""Заданное число N записали 100 раз
подряд и затем возвели в квадрат.
Что получилось?
Формат ввода
Вводится целое неотрицательное число N не превышающее 1000.
Формат вывода
Выведите ответ на задачу."""
n = input()
a = n * 100
print(int(a)**2)
