"""Дано положительное двузначное число.
Найдите число десятков в нем.
Формат ввода
Вводится единственное число
(гарантируется, что оно соответствует условию задачи).
Формат вывода
Выведите ответ на задачу."""
n = int(input())
n1 = n // 10
print(n1)
